Revit 2027 API
BuiltInFailures.RebarCouplerFailures.NewCouplerTypeCreated Property
 A new coupler type was automatically created to fit the bar diameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NewCouplerTypeCreated { get; }
Public Shared ReadOnly Property NewCouplerTypeCreated As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NewCouplerTypeCreated {
	FailureDefinitionId^ get ();
}
static member NewCouplerTypeCreated : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace